# Introduction to pandas data frame

In [ ]:
Data Frame is a main object in pandas. It is used to represent data with rows and columns. 

Data Frame is data structure represent the data in tabular or excel spread sheet.

### Creating Data Frame:

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\venky\appdata\roaming\python\python37\site-packages (1.0.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\venky\appdata\roaming\python\python37\site-packages (from pandas) (1.18.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\venky\appdata\local\continuum\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\venky\appdata\local\continuum\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\users\venky\appdata\roaming\python\python37\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [5]:
df=pd.read_csv(r"E:\Data Science Classes By Venky Naidu 2020\weather_data.csv")

In [6]:
df

        Day  temperature  windspeed  event
0  1/1/2020           32          6   Rain
1  1/2/2020           35          7  Sunny
2  1/3/2020           28          2   Snow
3  1/4/2020           24          7   Snow
4  1/5/2020           32          4   Rain
5  1/6/2020           31          2  Sunny

In [7]:
pwd

'C:\\Users\\venky\\Data Science Suresh'

In [8]:
data=pd.read_csv("weather_data.csv")

In [9]:
data

        Day  temperature  windspeed  event
0  1/1/2020           32          6   Rain
1  1/2/2020           35          7  Sunny
2  1/3/2020           28          2   Snow
3  1/4/2020           24          7   Snow
4  1/5/2020           32          4   Rain
5  1/6/2020           31          2  Sunny

In [ ]:
The other way of creating Data Frame is by using list of tuples

In [10]:
weather_data=[('1/1/2020',32,6,'Sunny'),
              ('1/2/2020',28,8,'Rainy'),
              ('1/3/2020',36,6,'Sunny'),
              ('1/4/2020',24,9,'Snow')
             ]

df=pd.DataFrame(weather_data,columns=['day','temperature','windspeed','event'])

In [11]:
df

        day  temperature  windspeed  event
0  1/1/2020           32          6  Sunny
1  1/2/2020           28          8  Rainy
2  1/3/2020           36          6  Sunny
3  1/4/2020           24          9   Snow

In [12]:
#to knwo shape of the data frame
df.shape

(4, 4)

In [13]:
data.shape

(6, 4)

In [14]:
#head is used read first 5 rows
data.head()

        Day  temperature  windspeed  event
0  1/1/2020           32          6   Rain
1  1/2/2020           35          7  Sunny
2  1/3/2020           28          2   Snow
3  1/4/2020           24          7   Snow
4  1/5/2020           32          4   Rain

In [15]:
#tail function is used to read last rows
data.tail()

        Day  temperature  windspeed  event
1  1/2/2020           35          7  Sunny
2  1/3/2020           28          2   Snow
3  1/4/2020           24          7   Snow
4  1/5/2020           32          4   Rain
5  1/6/2020           31          2  Sunny

In [16]:
data

        Day  temperature  windspeed  event
0  1/1/2020           32          6   Rain
1  1/2/2020           35          7  Sunny
2  1/3/2020           28          2   Snow
3  1/4/2020           24          7   Snow
4  1/5/2020           32          4   Rain
5  1/6/2020           31          2  Sunny

In [17]:
data[2:5]

        Day  temperature  windspeed event
2  1/3/2020           28          2  Snow
3  1/4/2020           24          7  Snow
4  1/5/2020           32          4  Rain

In [18]:
data.columns

Index(['Day', 'temperature', 'windspeed', 'event'], dtype='object')

In [20]:
data.Day

0    1/1/2020
1    1/2/2020
2    1/3/2020
3    1/4/2020
4    1/5/2020
5    1/6/2020
Name: Day, dtype: object

In [21]:
data.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [22]:
data['Day']

0    1/1/2020
1    1/2/2020
2    1/3/2020
3    1/4/2020
4    1/5/2020
5    1/6/2020
Name: Day, dtype: object

In [28]:
data['Day']

0    1/1/2020
1    1/2/2020
2    1/3/2020
3    1/4/2020
4    1/5/2020
5    1/6/2020
Name: Day, dtype: object

In [30]:
data['Day']

0    1/1/2020
1    1/2/2020
2    1/3/2020
3    1/4/2020
4    1/5/2020
5    1/6/2020
Name: Day, dtype: object

In [32]:
data['temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [33]:
data['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [34]:
data['temperature'].max()

35

In [35]:
data['temperature'].min()

24

In [40]:
data=pd.read_csv(r'E:\Data Science Classes By Venky Naidu 2020\weather_data.csv')

In [41]:
data

        Day  temperature  windspeed  event
0  1/1/2020           32          6   Rain
1  1/2/2020           35          7  Sunny
2  1/3/2020           28          2   Snow
3  1/4/2020           24          7   Snow
4  1/5/2020           32          4   Rain
5  1/6/2020           31          2  Sunny
6  1/7/2020           35          7  sunny

In [42]:
#to  select maximum temperature rows
data[data.temperature==data.temperature.max()]

        Day  temperature  windspeed  event
1  1/2/2020           35          7  Sunny
6  1/7/2020           35          7  sunny

In [43]:
data.Day[data.temperature==data.temperature.max()]

1    1/2/2020
6    1/7/2020
Name: Day, dtype: object

In [44]:
data.temperature[data.temperature==data.temperature.max()]

1    35
6    35
Name: temperature, dtype: int64

# Read and write CSV and XLS files:

In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("weather_data.csv")

In [3]:
data

        Day  temperature  windspeed  event
0  1/1/2020           32          6   Rain
1  1/2/2020           35          7  Sunny
2  1/3/2020           28          2   Snow
3  1/4/2020           24          7   Snow
4  1/5/2020           32          4   Rain
5  1/6/2020           31          2  Sunny

In [6]:
#read excel file
data1=pd.read_excel('weather_data.xlsx')

In [7]:
data1

                   day  temperature  windspeed  event
0             1/1/2017           32          6   Rain
1             1/2/2017           35          7  Sunny
2             1/3/2017           28          2   Snow
3             1/4/2017           24          7   Snow
4             1/5/2017           32          4   Rain
5             1/6/2017           31          2  Sunny
6  2020-01-07 00:00:00           38          8  Sunny

In [8]:
#writing DF to CSV
data.to_csv('suresh.csv')

In [11]:
data.to_csv('laxmi.csv',index=False)

In [14]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\venky\appdata\local\continuum\anaconda3\lib\site-packages (3.0.0)
Requirement already satisfied: jdcal in c:\users\venky\appdata\local\continuum\anaconda3\lib\site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in c:\users\venky\appdata\local\continuum\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Note: you may need to restart the kernel to use updated packages.

In [16]:
#Write DF to Excel
data1.to_excel('venky.xlsx',sheet_name='weather_data')

In [19]:
data1

                   day  temperature  windspeed  event
0             1/1/2017           32          6   Rain
1             1/2/2017           35          7  Sunny
2             1/3/2017           28          2   Snow
3             1/4/2017           24          7   Snow
4             1/5/2017           32          4   Rain
5             1/6/2017           31          2  Sunny
6  2020-01-07 00:00:00           38          8  Sunny

In [20]:
data2=pd.read_excel("venky.xlsx",index=False)

In [22]:
data2.to_excel("naidu.xlsx",index=False)

In [24]:
data5=pd.read_excel('naidu.xlsx')

In [25]:
data5

   Unnamed: 0                  day  temperature  windspeed  event
0           0             1/1/2017           32          6   Rain
1           1             1/2/2017           35          7  Sunny
2           2             1/3/2017           28          2   Snow
3           3             1/4/2017           24          7   Snow
4           4             1/5/2017           32          4   Rain
5           5             1/6/2017           31          2  Sunny
6           6  2020-01-07 00:00:00           38          8  Sunny

In [26]:
data5.columns

Index(['Unnamed: 0', 'day', 'temperature', 'windspeed', 'event'], dtype='object')

In [27]:
data5['day']

0               1/1/2017
1               1/2/2017
2               1/3/2017
3               1/4/2017
4               1/5/2017
5               1/6/2017
6    2020-01-07 00:00:00
Name: day, dtype: object

# Group by

In [28]:
import pandas as pd
df=pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [29]:
g=df.groupby('city')
g

In [30]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [31]:
#to get specific group data
g.get_group("new york")

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [32]:
#to get specific group data
g.get_group("paris")

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [33]:
#find maximum temperature of each city
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [34]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [35]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatinate Data Frames:

In [8]:
import pandas as pd
india_weather=pd.DataFrame({"city":['mumbai','delhi','bangalore'],
                            "Temperature":[37,28,30],
                            "Humidity":[80,60,78]})

In [9]:
india_weather

        city  Temperature  Humidity
0     mumbai           37        80
1      delhi           28        60
2  bangalore           30        78

In [10]:
us_weather=pd.DataFrame({"city":['New york','chicago','orland'],
                        "Temperature":[21,14,35],
                        "Humidity":[68,56,73]})

In [11]:
us_weather

       city  Temperature  Humidity
0  New york           21        68
1   chicago           14        56
2    orland           35        73

In [12]:
#concatinate two data frames
df=pd.concat([india_weather,us_weather])

In [13]:
df

        city  Temperature  Humidity
0     mumbai           37        80
1      delhi           28        60
2  bangalore           30        78
0   New york           21        68
1    chicago           14        56
2     orland           35        73

In [14]:
#if you want contineous index
df=pd.concat([india_weather,us_weather],ignore_index=True)

In [15]:
df

        city  Temperature  Humidity
0     mumbai           37        80
1      delhi           28        60
2  bangalore           30        78
3   New york           21        68
4    chicago           14        56
5     orland           35        73

In [16]:
df=pd.concat([india_weather,us_weather],axis=1)

In [17]:
df

        city  Temperature  Humidity      city  Temperature  Humidity
0     mumbai           37        80  New york           21        68
1      delhi           28        60   chicago           14        56
2  bangalore           30        78    orland           35        73

In [18]:
df=pd.concat([india_weather,us_weather],axis=0)

In [19]:
df

        city  Temperature  Humidity
0     mumbai           37        80
1      delhi           28        60
2  bangalore           30        78
0   New york           21        68
1    chicago           14        56
2     orland           35        73

# Merge Data Frames

In [20]:
temperature_df=pd.DataFrame({"city":['mumbai','delhi','bangalore'],
                            "Temperature":[37,28,30]})

In [21]:
temperature_df

        city  Temperature
0     mumbai           37
1      delhi           28
2  bangalore           30

In [22]:
humidity_df=pd.DataFrame({"city":['delhi','mumbai','bangalore'],
                         "humidity":[68,75,76]})

In [23]:
humidity_df

        city  humidity
0      delhi        68
1     mumbai        75
2  bangalore        76

In [24]:
#merging of two data frames wihtout explicit mention index
df=pd.merge(temperature_df,humidity_df,on='city')

In [25]:
df

        city  Temperature  humidity
0     mumbai           37        75
1      delhi           28        68
2  bangalore           30        76

In [26]:
temperature_df=pd.DataFrame({"city":['mumbai','delhi','bangalore','Hyderabad'],
                            "Temperature":[37,28,30,45]})

In [27]:
temperature_df

        city  Temperature
0     mumbai           37
1      delhi           28
2  bangalore           30
3  Hyderabad           45

In [28]:
#merging of two data frames wihtout explicit mention index
df=pd.merge(temperature_df,humidity_df,on='city')

In [29]:
df

        city  Temperature  humidity
0     mumbai           37        75
1      delhi           28        68
2  bangalore           30        76

In [30]:
humidity_df=pd.DataFrame({"city":['delhi','mumbai','bangalore','Hyderabad'],
                         "humidity":[68,75,76,80]})

In [31]:
#merging of two data frames wihtout explicit mention index
df=pd.merge(temperature_df,humidity_df,on='city')

In [32]:
df

        city  Temperature  humidity
0     mumbai           37        75
1      delhi           28        68
2  bangalore           30        76
3  Hyderabad           45        80

In [33]:
#OUTER JOIN
df=pd.merge(temperature_df,humidity_df, on='city',how='outer')

In [34]:
df

        city  Temperature  humidity
0     mumbai           37        75
1      delhi           28        68
2  bangalore           30        76
3  Hyderabad           45        80

# Numerical Indexing

In [ ]:
.loc  vs iloc

In [35]:
df=pd.DataFrame([1,2,3,4,5,6,7,8,9,19],index=[49,48,47,36,1,2,3,4,80,90])

In [36]:
df

     0
49   1
48   2
47   3
36   4
1    5
2    6
3    7
4    8
80   9
90  19

In [38]:
df.loc[:2]

    0
49  1
48  2
47  3
36  4
1   5
2   6

In [39]:
df.loc[:36]

    0
49  1
48  2
47  3
36  4

In [40]:
df.loc[1:80]

    0
1   5
2   6
3   7
4   8
80  9

In [41]:
df.iloc[:2]

    0
49  1
48  2

In [42]:
df.iloc[:6]

    0
49  1
48  2
47  3
36  4
1   5
2   6

In [45]:
df.loc[36]

0    4
Name: 36, dtype: int64

In [46]:
df.iloc[36]

IndexError: single positional indexer is out-of-bounds

In [48]:
df.iloc[9]

0    19
Name: 90, dtype: int64